tutorials/multiphaseEuler/damBreak4phase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.air       1;
    alpha.water     0;
    alpha.oil       0;
    alpha.mercury   0;
}

zones
{
    water
    {
        type        box;
        zoneType    cell;

        box         (0 0 -1) (0.1461 0.292 1);

        values
        {
            alpha.water     1;
            alpha.oil       0;
            alpha.mercury   0;
            alpha.air       0;
        }
    }

    oil
    {
        type        box;
        zoneType    cell;

        box         (0.1461 0 -1) (0.2922 0.292 1);

        values
        {
            alpha.water     0;
            alpha.oil       1;
            alpha.mercury   0;
            alpha.air       0;
        }
    }

    mercury
    {
        type        box;
        zoneType    cell;

        box         (0 0 -1) (0.1461 0.1 1);

        values
        {
            alpha.water     0;
            alpha.oil       0;
            alpha.mercury   1;
            alpha.air       0;
        }
    }
}


// ************************************************************************* //
